; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-5-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-2 - location
	p1-3 - location
	p1-6 - location
	p4-0 - location
	p6-0 - location
	p6-3 - location
	p6-4 - location
	p6-5 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s3)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s6)
	(empty truck3)
	(at truck4 s6)
	(empty truck4)
	(at truck5 s6)
	(empty truck5)
	(at package1 s5)
	(at package2 s5)
	(at package3 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 17)
	(= (time-to-walk p0-1 s0) 17)
	(= (time-to-walk s1 p0-1) 53)
	(= (time-to-walk p0-1 s1) 53)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 28)
	(= (time-to-walk p0-2 s0) 28)
	(= (time-to-walk s2 p0-2) 100)
	(= (time-to-walk p0-2 s2) 100)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 9)
	(= (time-to-walk p1-3 s1) 9)
	(= (time-to-walk s3 p1-3) 78)
	(= (time-to-walk p1-3 s3) 78)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 4)
	(= (time-to-walk p1-6 s1) 4)
	(= (time-to-walk s6 p1-6) 56)
	(= (time-to-walk p1-6 s6) 56)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 37)
	(= (time-to-walk p4-0 s4) 37)
	(= (time-to-walk s0 p4-0) 23)
	(= (time-to-walk p4-0 s0) 23)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 41)
	(= (time-to-walk p6-0 s6) 41)
	(= (time-to-walk s0 p6-0) 90)
	(= (time-to-walk p6-0 s0) 90)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 32)
	(= (time-to-walk p6-3 s6) 32)
	(= (time-to-walk s3 p6-3) 32)
	(= (time-to-walk p6-3 s3) 32)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 54)
	(= (time-to-walk p6-4 s6) 54)
	(= (time-to-walk s4 p6-4) 57)
	(= (time-to-walk p6-4 s4) 57)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 18)
	(= (time-to-walk p6-5 s6) 18)
	(= (time-to-walk s5 p6-5) 35)
	(= (time-to-walk p6-5 s5) 35)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 16)
	(= (time-to-drive s0 s1) 16)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 9)
	(= (time-to-drive s0 s2) 9)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 31)
	(= (time-to-drive s1 s2) 31)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 99)
	(= (time-to-drive s5 s3) 99)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 94)
	(= (time-to-drive s1 s4) 94)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 16)
	(= (time-to-drive s2 s4) 16)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 72)
	(= (time-to-drive s0 s5) 72)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 71)
	(= (time-to-drive s1 s5) 71)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 22)
	(= (time-to-drive s4 s5) 22)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 11)
	(= (time-to-drive s6 s5) 11)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 25)
	(= (time-to-drive s1 s6) 25)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 49)
	(= (time-to-drive s2 s6) 49)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 99)
	(= (time-to-drive s3 s6) 99)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 42)
	(= (time-to-drive s4 s6) 42)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s3)
	(at driver3 s2)
	(at truck4 s5)
	(at truck5 s6)
	(at package1 s5)
	(at package2 s0)
	(at package3 s1)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 2  (driven))) (* 2  (walked))))

)

; plan
1. (walk driver2 s1 p1-3)
   deleted: (at driver2 s1)
   added: (at driver2 p1-3)
   changed: (walked) from 0 to 9
   goals met: 2 of 8
2. (walk driver1 s1 p1-6)
   deleted: (at driver1 s1)
   added: (at driver1 p1-6)
   changed: (walked) from 9 to 13
   goals met: 2 of 8
3. (load-truck package3 truck1 s3)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   goals met: 2 of 8
4. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 2 of 8
5. (drive-truck truck1 s3 s5 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (driven) from 0 to 99
   goals met: 2 of 8
6. (walk driver2 p1-3 s3)
   deleted: (at driver2 p1-3)
   added: (at driver2 s3)
   changed: (walked) from 13 to 91
   goals met: 3 of 8
7. (walk driver1 p1-6 s6)
   deleted: (at driver1 p1-6)
   added: (at driver1 s6)
   changed: (walked) from 91 to 147
   goals met: 3 of 8
8. (board-truck driver1 truck4 s6)
   deleted: (at driver1 s6) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 3 of 8
9. (drive-truck truck4 s6 s4 driver1)
   deleted: (at truck4 s6)
   added: (at truck4 s4)
   changed: (driven) from 99 to 141
   goals met: 3 of 8
10. (load-truck package2 truck1 s5)
   deleted: (at package2 s5)
   added: (in package2 truck1)
   goals met: 3 of 8
11. (drive-truck truck1 s5 s0 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (driven) from 141 to 213
   goals met: 3 of 8
12. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 4 of 8
13. (drive-truck truck1 s0 s1 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (driven) from 213 to 229
   goals met: 4 of 8
14. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 5 of 8
15. (drive-truck truck4 s4 s5 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s5)
   changed: (driven) from 229 to 251
   goals met: 6 of 8
16. (disembark-truck driver1 truck4 s5)
   deleted: (driving driver1 truck4)
   added: (at driver1 s5) (empty truck4)
   goals met: 6 of 8
17. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 8
18. (drive-truck truck2 s5 s4 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (driven) from 251 to 273
   goals met: 6 of 8
19. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 7 of 8
20. (disembark-truck driver4 truck1 s1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s1) (empty truck1)
   goals met: 7 of 8
21. (board-truck driver3 truck1 s1)
   deleted: (at driver3 s1) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 8
22. (drive-truck truck1 s1 s2 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 273 to 304
   goals met: 7 of 8
23. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 8 of 8
